leetcode_1074_number_of_submatrices_that_sum_to_target.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 1074. Number of Submatrices That Sum to Target</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Leetcode: 1074. Number of Submatrices That Sum to Target</h1>
<ul class="org-ul">
<li><a href="mistake_did_not_try_hard_to_solve_alternative_problem.html#ID-AC9291C6-4C72-4143-80F2-0D414EF7B681">Mistake: Did not try hard to solve alternative problem</a>.  I saw the transformation but couldn't see the linear solution for it.</li>

<li><a href="is_there_an_alternative_problem_easier_to_solve.html#ID-64E7E55B-09A9-4022-AB5E-1D25FC64EAC9">Is there an alternative problem easier to solve?</a>  Given an array of numbers and a target \(t\), find the number of subarrays which sum is equal to \(t\).  Be \(p[i]=\sum_{0 \leq j \leq i}a[j]\).  The number of valid subarrays ending on \(i\) is the number of times that \(p[i]-target\) appeared in \(p[0..(i-1)]\) plus 1 if \(p[i]=t\).  We can transform the 2D problem in the 1D by keeping an accumulated sum for each column and creating the array of numbers after fixing two rows \(i0\) and \(i0\).  Time complexity is \(O(n^2 \times m)\) and space complexity is \(O(n \times m)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List
<span style="font-weight: bold;">from</span> collections <span style="font-weight: bold;">import</span> defaultdict


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">numSubmatrixSumTarget</span>(<span style="font-weight: bold;">self</span>, m: List[List[<span style="font-weight: bold;">int</span>]], target: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(m)
        <span style="font-weight: bold; font-style: italic;">M</span> = <span style="font-weight: bold;">len</span>(m[0])

        <span style="font-weight: bold; font-style: italic;">csum</span> = [[0] * M <span style="font-weight: bold;">for</span> _ <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N)]
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N):
            <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(M):
                csum[i][<span style="font-weight: bold; font-style: italic;">j</span>] = m[i][j]
                <span style="font-weight: bold;">if</span> i &gt; 0:
                    csum[i][<span style="font-weight: bold; font-style: italic;">j</span>] += csum[i - 1][j]
        <span style="font-weight: bold; font-style: italic;">ans</span> = 0
        <span style="font-weight: bold;">for</span> i0 <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N):
            <span style="font-weight: bold;">for</span> i1 <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(i0, N):
                <span style="font-weight: bold; font-style: italic;">freq</span> = defaultdict(<span style="font-weight: bold;">int</span>)
                <span style="font-weight: bold; font-style: italic;">cur</span> = 0
                <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(M):
                    <span style="font-weight: bold; font-style: italic;">cur</span> += csum[i1][j]
                    <span style="font-weight: bold;">if</span> i0 &gt; 0:
                        <span style="font-weight: bold; font-style: italic;">cur</span> -= csum[i0 - 1][j]
                    <span style="font-weight: bold; font-style: italic;">ans</span> += freq[cur - target]
                    <span style="font-weight: bold;">if</span> cur == target:
                        ans += 1
                    freq[<span style="font-weight: bold; font-style: italic;">cur</span>] += 1
        <span style="font-weight: bold;">return</span> ans


<span style="font-weight: bold;">assert</span> Solution().numSubmatrixSumTarget([[0, 1, 0], [1, 1, 1], [0, 1, 0]], 0) == 4
<span style="font-weight: bold;">assert</span> Solution().numSubmatrixSumTarget([[1, -1], [-1, 1]], 0) == 5
<span style="font-weight: bold;">assert</span> Solution().numSubmatrixSumTarget([[904]], 0) == 0
</pre>
</div>
</div>
</body>
</html>